---
kind: other
id: Properties.T:Autodesk.Revit.DB.BRepBuilder
source: html/07ad2b9f-1d9e-2c0d-3429-87e01a7f3f0d.htm
---
# BRepBuilder Properties

Specifies whether the .NET object represents a valid Revit entity.